src/bsl/InformationRegisters/гкс_НастройкаЭлектронногоТабло.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_НастройкаЭлектронногоТабло</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТабло</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ВидыЭлектронныхТабло</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Табло</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ЭлектронныеТабло</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Весы</Name>
					<Comment>ERP-1425</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ОборудованиеПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЯмаРазгрузки</Name>
					<Comment>ERP-1425</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_НастройкаЭлектронногоТабло/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьНастройки(СсылкаНаТабло) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкаЭлектронногоТабло.ТочкаМаршрута КАК ТочкаМаршрута,
	|	НастройкаЭлектронногоТабло.ВидТабло КАК ВидТабло,
	|	НастройкаЭлектронногоТабло.Табло КАК Табло,
	|	НастройкаЭлектронногоТабло.Номенклатура КАК Номенклатура,
	|	НастройкаЭлектронногоТабло.Весы КАК Весы,
	|	НастройкаЭлектронногоТабло.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	НастройкаЭлектронногоТабло.ВидПеревозки КАК ВидПеревозки
	|ИЗ
	|	РегистрСведений.гкс_НастройкаЭлектронногоТабло КАК НастройкаЭлектронногоТабло
	|ГДЕ
	|	НастройкаЭлектронногоТабло.Табло = &Табло";
	
	Запрос.УстановитьПараметр("Табло", СсылкаНаТабло);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НомерСтроки = 0;
		ДанныеЗапроса = РезультатЗапроса.Выгрузить();
		Результат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеЗапроса[НомерСтроки]);
	Иначе	
		Результат = Неопределено;	
	КонецЕсли;
	
	Возврат Результат;
							
КонецФункции

#КонецОбласти

#КонецЕсли
